PS C:\FPC\c_activity_sets\set02> gcc problem07.c
PS C:\FPC\c_activity_sets\set02> gdb a.exe      
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
Reading symbols from C:\FPC\c_activity_sets\set02\a.exe...done.
(gdb) HHHq
Undefined command: "HHHq".  Try "help".
PS C:\FPC\c_activity_sets\set02> ./a.exe
Enter the base of the triangle: 3
Enter the height of the triangle: 3
The area of the triangle with base 3.000000 and height 3.000000 is 4.500000
PS C:\FPC\c_activity_sets\set02> gcc problem07.c
PS C:\FPC\c_activity_sets\set02> ./a.exe        
Enter the base of the triangle: 2
Enter the height of the triangle: 3
The area of the triangle with base 2.000000 and height 3.000000 is 3.000000
PS C:\FPC\c_activity_sets\set02> gcc problem07.c -O0 -g
PS C:\FPC\c_activity_sets\set02> gdb a.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\FPC\c_activity_sets\set02\a.exe...done.
(gdb) l
8       Triangle;
9
10      Triangle input_triangle();
11      void find_area(Triangle *t);
12      void output(Triangle t);
13
14      int main()
15      {
16              Triangle t;
17              t = input_triangle();
(gdb) b main
Breakpoint 1 at 0x40146e: file problem07.c, line 17.
(gdb) r
Starting program: C:\FPC\c_activity_sets\set02/a.exe 
[New Thread 1212.0x19e8]
[New Thread 1212.0x3148]

Breakpoint 1, main () at problem07.c:17
17              t = input_triangle();
(gdb) n
Enter the base of the triangle: 2
Enter the height of the triangle: 3
18              find_area(&t);
(gdb) n  
19              output(t);
(gdb) n
The area of the triangle with base 2.000000 and height 3.000000 is 3.00000020           return 0;
(gdb) n
21      }
(gdb) q
A debugging session is active.

        Inferior 1 [process 1212] will be killed.

Quit anyway? (y or n) y
error return ../../gdb-7.6.1/gdb/windows-nat.c:1275 was 5