PS C:\FPC\c_activity_sets\set01> gcc problem04.c -O0 -g
PS C:\FPC\c_activity_sets\set01> gdb a.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\FPC\c_activity_sets\set01\a.exe...done.
(gdb) l
1       #include <stdio.h>
2
3       void input(int *a, int *b);
4       void add(int a, int b, int *sum);
5       void output(int a, int b, int sum);
6
7       int main()
8       {
9           int a, b, sum;
10          input(&a, &b);
(gdb) b main
Breakpoint 1 at 0x40146e: file problem04.c, line 10.
(gdb) r
Starting program: C:\FPC\c_activity_sets\set01/a.exe 
[New Thread 8288.0x2dd4]
[New Thread 8288.0x2fac]

Breakpoint 1, main () at problem04.c:10
10          input(&a, &b);
(gdb) n
Enter the first number: 4
Enter the second number: 3
11          add(a, b, &sum);
(gdb) n
12          output(a, b, sum);
(gdb) n
The sum of 4 and 3 is 713           return 0;
(gdb) n
14      }
(gdb) q
A debugging session is active.

        Inferior 1 [process 8288] will be killed.

Quit anyway? (y or n) y
error return ../../gdb-7.6.1/gdb/windows-nat.c:1275 was 5