PS C:\FPC\c_activity_sets\set05> gcc problem02.c -O0 -g
PS C:\FPC\c_activity_sets\set05> gdb a.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\FPC\c_activity_sets\set05\a.exe...done.
(gdb) l
4       void input_camel_details(float *radius, float *height, float *length);
5       float find_weight(float radius, float height, float length);
6       void output(float radius, float height, float length, float weight);
7
8       // `weight = pi * stomach_radius^3 * sqrt(height * length)`
9
10      int main()
11      {
12          float radius, height, length, weight;
13          input_camel_details(&radius, &height, &length);
(gdb) b main
Breakpoint 1 at 0x40146e: file problem02.c, line 13.
(gdb) r
Starting program: C:\FPC\c_activity_sets\set05/a.exe 
[New Thread 14248.0x3274]
[New Thread 14248.0x21a0]

Breakpoint 1, main () at problem02.c:13
13          input_camel_details(&radius, &height, &length);
(gdb) n
Enter the stomach radius of the camel: 1
Enter the height of the camel: 1
Enter the length of the camel: 1
14          weight = find_weight(radius, height, length);
(gdb) step
find_weight (radius=1, height=1, length=1) at problem02.c:32
32          float pi = 3.1415;
(gdb) n 
33          weight = pi * radius * radius * radius * sqrt(height * length);
(gdb) n
34          return weight;
(gdb) n
35      }
(gdb) n
main () at problem02.c:15
15          output(radius, height, length, weight);
(gdb) n
The weight of a camel with stomach radius 1.00, height 1.00 and length 1.00 is 3.141516     return 0;
(gdb) n
17      }
(gdb) q
A debugging session is active.

        Inferior 1 [process 14248] will be killed.

Quit anyway? (y or n) y
error return ../../gdb-7.6.1/gdb/windows-nat.c:1275 was 5