PS C:\FPC\c_activity_sets\set05> gcc problem04.c -O0 -g
PS C:\FPC\c_activity_sets\set05> gdb a.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"   
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\FPC\c_activity_sets\set05\a.exe...done.
(gdb) l
1       #include <stdio.h>
2
3       void input_camel_details(float *radius, float *height, float *length);
4       int find_mood(float radius, float height, float length);
5       void output(float radius, float height, float length, int mood);
6
7       int main()
8       {
9           float radius, height, length, weight;
10          input_camel_details(&radius, &height, &length);
(gdb) b main
Breakpoint 1 at 0x40146e: file problem04.c, line 10.
(gdb) r
Starting program: C:\FPC\c_activity_sets\set05/a.exe 
[New Thread 12704.0x1b70]
[New Thread 12704.0x185c]

Breakpoint 1, main () at problem04.c:10
10          input_camel_details(&radius, &height, &length);
(gdb) n
Enter the stomach radius of the camel: 5
Enter the height of the camel: 2
Enter the length of the camel: 4
12          mood = find_mood(radius, height, length);
(gdb) step
find_mood (radius=5, height=2, length=4) at problem04.c:30
30          if (radius < height && radius < length) // camel is sick
(gdb) n
34          else if (height < length && height < radius) // camel is happy
(gdb) n
36              return 2;
(gdb) n
47      }
(gdb) n
main () at problem04.c:13
13          output(radius, height, length, mood);
(gdb) n
Camel is happy.14           return 0;
(gdb) n
15      }
(gdb) q
A debugging session is active.

        Inferior 1 [process 12704] will be killed.

Quit anyway? (y or n) y
error return ../../gdb-7.6.1/gdb/windows-nat.c:1275 was 5